Repository: konk1n12/travel-buddy-ai
Catalog: ios/Travell Buddy/Localizable.xcstrings
Source language: ru
Languages: ar, de, en, es, fr, zh_hans

# aiStudio.dayParameters
source: Параметры дня
ar: معايير اليوم
de: Tagesparameter
en: Day parameters
es: Parámetros del día
fr: Paramètres du jour
zh_hans: 日程参数

# aiStudio.tempo
source: Темп
ar: الإيقاع
de: Tempo
en: Tempo
es: Ritmo
fr: Rythme
zh_hans: 节奏

# aiStudio.title
source: AI Студия
ar: استوديو AI
de: AI Studio
en: AI Studio
es: AI Studio
fr: AI Studio
zh_hans: AI工作室

# auth.confirm
source: Подтвердить
ar: تأكيد
de: Bestätigen
en: Confirm
es: Confirmar
fr: Confirmer
zh_hans: 确认

# auth.enterCode
source: Введите код из письма
ar: أدخل الرمز من البريد الإلكتروني
de: Code aus der E-Mail eingeben
en: Enter code from email
es: Introduce el código del email
fr: Entrez le code de l'email
zh_hans: 输入邮件中的验证码

# auth.enterEmail
source: Введите email
ar: أدخل البريد الإلكتروني
de: E-Mail eingeben
en: Enter email
es: Introduce el email
fr: Entrez l'email
zh_hans: 输入电子邮箱

# auth.login
source: Войти
ar: تسجيل الدخول
de: Anmelden
en: Login
es: Iniciar sesión
fr: Connexion
zh_hans: 登录

# auth.logout
source: Выйти
ar: تسجيل الخروج
de: Abmelden
en: Logout
es: Cerrar sesión
fr: Déconnexion
zh_hans: 退出登录

# auth.resendCode
source: Отправить код повторно
ar: إعادة إرسال الرمز
de: Code erneut senden
en: Resend code
es: Reenviar código
fr: Renvoyer le code
zh_hans: 重新发送验证码

# auth.sendCode
source: Отправить код
ar: إرسال الرمز
de: Code senden
en: Send code
es: Enviar código
fr: Envoyer le code
zh_hans: 发送验证码

# chat.messageFailed
source: Сообщение не отправлено
ar: فشل إرسال الرسالة
de: Nachricht nicht gesendet
en: Message not sent
es: Mensaje no enviado
fr: Message non envoyé
zh_hans: 消息未发送

# chat.online
source: Онлайн
ar: متصل
de: Online
en: Online
es: En línea
fr: En ligne
zh_hans: 在线

# chat.placeholder
source: Напишите свои пожелания к маршруту
ar: اكتب تفضيلات مسارك
de: Geben Sie Ihre Routenpräferenzen ein
en: Write your route preferences
es: Escribe tus preferencias de ruta
fr: Écrivez vos préférences d'itinéraire
zh_hans: 写下您的路线偏好

# chat.startDialog
source: Начни диалог с AI‑агентом
ar: ابدأ حوارًا مع وكيل AI
de: Starten Sie einen Dialog mit dem AI-Agenten
en: Start a dialog with AI agent
es: Inicia un diálogo con el agente AI
fr: Commencez un dialogue avec l'agent AI
zh_hans: 开始与AI助手对话

# chat.title
source: Чат с Travel Buddy
ar: الدردشة مع Travel Buddy
de: Chat mit Travel Buddy
en: Chat with Travel Buddy
es: Chat con Travel Buddy
fr: Discuter avec Travel Buddy
zh_hans: 与Travel Buddy聊天

# chat.typing
source: Печатает...
ar: يكتب...
de: Schreibt...
en: Typing...
es: Escribiendo...
fr: En train d'écrire...
zh_hans: 正在输入...

# common.button.back
source: Назад
ar: رجوع
de: Zurück
en: Back
es: Atrás
fr: Retour
zh_hans: 返回

# common.button.cancel
source: Отменить
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
zh_hans: 取消

# common.button.close
source: Закрыть
ar: إغلاق
de: Schließen
en: Close
es: Cerrar
fr: Fermer
zh_hans: 关闭

# common.button.continue
source: Продолжить
ar: متابعة
de: Weiter
en: Continue
es: Continuar
fr: Continuer
zh_hans: 继续

# common.button.delete
source: Удалить
ar: حذف
de: Löschen
en: Delete
es: Eliminar
fr: Supprimer
zh_hans: 删除

# common.button.done
source: Готово
ar: تم
de: Fertig
en: Done
es: Listo
fr: Terminé
zh_hans: 完成

# common.button.retry
source: Повторить
ar: إعادة المحاولة
de: Erneut versuchen
en: Retry
es: Reintentar
fr: Réessayer
zh_hans: 重试

# common.button.save
source: Сохранить
ar: حفظ
de: Speichern
en: Save
es: Guardar
fr: Enregistrer
zh_hans: 保存

# common.button.skip
source: Пропустить
ar: تخطي
de: Überspringen
en: Skip
es: Omitir
fr: Passer
zh_hans: 跳过

# error.loadFailed
source: Не удалось загрузить данные
ar: فشل تحميل البيانات
de: Laden fehlgeschlagen
en: Failed to load data
es: Error al cargar datos
fr: Échec du chargement des données
zh_hans: 加载数据失败

# error.network
source: Ошибка сети. Проверьте подключение.
ar: خطأ في الشبكة. يرجى التحقق من اتصالك.
de: Netzwerkfehler. Bitte überprüfen Sie Ihre Verbindung.
en: Network error. Please check your connection.
es: Error de red. Comprueba tu conexión.
fr: Erreur réseau. Veuillez vérifier votre connexion.
zh_hans: 网络错误。请检查您的连接。

# error.routeGeneration
source: Ошибка создания маршрута
ar: خطأ في إنشاء المسار
de: Fehler bei der Routenerstellung
en: Route generation error
es: Error al generar la ruta
fr: Erreur de génération d'itinéraire
zh_hans: 路线生成错误

# error.routeLoadFailed
source: Не удалось загрузить маршрут
ar: فشل تحميل المسار
de: Route konnte nicht geladen werden
en: Failed to load route
es: Error al cargar la ruta
fr: Échec du chargement de l'itinéraire
zh_hans: 加载路线失败

# error.server
source: Ошибка сервера. Попробуйте позже.
ar: خطأ في الخادم. يرجى المحاولة لاحقاً.
de: Serverfehler. Bitte versuchen Sie es später erneut.
en: Server error. Please try again later.
es: Error del servidor. Inténtalo más tarde.
fr: Erreur serveur. Veuillez réessayer plus tard.
zh_hans: 服务器错误。请稍后重试。

# flight.number.placeholder
source: Например: SU2578
ar: مثال: SU2578
de: z.B.: SU2578
en: e.g.: SU2578
es: ej.: SU2578
fr: ex.: SU2578
zh_hans: 例如：SU2578

# flight.outbound
source: Рейс туда
ar: رحلة الذهاب
de: Hinflug
en: Outbound flight
es: Vuelo de ida
fr: Vol aller
zh_hans: 去程航班

# flight.return
source: Рейс обратно
ar: رحلة العودة
de: Rückflug
en: Return flight
es: Vuelo de vuelta
fr: Vol retour
zh_hans: 返程航班

# flight.title
source: Добавить билет
ar: أضف تذكرة
de: Ticket hinzufügen
en: Add ticket
es: Añadir billete
fr: Ajouter un billet
zh_hans: 添加机票

# home.action.addFlightTicket
source: Добавить билет на самолет
ar: إضافة تذكرة طيران
de: Flugticket hinzufügen
en: Add flight ticket
es: Añadir billete de avión
fr: Ajouter un billet d'avion
zh_hans: 添加机票

# home.action.audioGuide
source: Аудио гид по местам
ar: دليل صوتي للأماكن
de: Audio-Guide für Orte
en: Audio guide for places
es: Audioguía de lugares
fr: Audioguide des lieux
zh_hans: 景点 语音导览

# home.action.bestPrices
source: Выгодные цены
ar: أفضل الأسعار
de: Beste Preise
en: Best prices
es: Mejores precios
fr: Meilleurs prix
zh_hans: 最优价格

# home.action.buildSmartPath
source: Построить умный путь
ar: إنشاء مسار ذكي
de: Smarten Weg erstellen
en: Build smart path
es: Crear ruta inteligente
fr: Créer un trajet intelligent
zh_hans: 创建 智能路径

# home.action.findHotel
source: Подобрать отель
ar: البحث عن فندق
de: Hotel finden
en: Find hotel
es: Buscar hotel
fr: Trouver un hôtel
zh_hans: 查找 酒店

# home.action.liveGuide
source: Live-гид
ar: مرشد مباشر
de: Live-Guide
en: Live Guide
es: Guía en vivo
fr: Guide en direct
zh_hans: 实时导游

# home.action.route
source: Маршрут
ar: المسار
de: Route
en: Route
es: Ruta
fr: Itinéraire
zh_hans: 路线

# home.all
source: Все
ar: الكل
de: Alle
en: All
es: Todos
fr: Tous
zh_hans: 全部

# home.cta.generateRoute
source: Сгенерировать маршрут
ar: إنشاء المسار
de: Route erstellen
en: Generate route
es: Generar ruta
fr: Générer l'itinéraire
zh_hans: 生成路线

# home.explore
source: Исследуй
ar: استكشف
de: Entdecken
en: Explore
es: Explorar
fr: Explorer
zh_hans: 探索

# home.myTrips
source: Мои поездки
ar: رحلاتي
de: Meine Reisen
en: My trips
es: Mis viajes
fr: Mes voyages
zh_hans: 我的行程

# interests.architecture
source: Архитектура
ar: العمارة
de: Architektur
en: Architecture
es: Arquitectura
fr: Architecture
zh_hans: 建筑

# interests.gastro
source: Гастро
ar: فن الطهي
de: Gastronomie
en: Gastro
es: Gastronomía
fr: Gastronomie
zh_hans: 美食

# interests.museums
source: Музеи
ar: المتاحف
de: Museen
en: Museums
es: Museos
fr: Musées
zh_hans: 博物馆

# interests.nature
source: Природа
ar: الطبيعة
de: Natur
en: Nature
es: Naturaleza
fr: Nature
zh_hans: 自然

# interests.nightlife
source: Ночная жизнь
ar: الحياة الليلية
de: Nachtleben
en: Nightlife
es: Vida nocturna
fr: Vie nocturne
zh_hans: 夜生活

# interests.shopping
source: Шопинг
ar: التسوق
de: Einkaufen
en: Shopping
es: Compras
fr: Shopping
zh_hans: 购物

# interests.title
source: Выберите интересы
ar: اختر اهتماماتك
de: Wählen Sie Ihre Interessen
en: Choose your interests
es: Elige tus intereses
fr: Choisissez vos centres d'intérêt
zh_hans: 选择您的兴趣

# loading
source: Загрузка...
ar: جاري التحميل...
de: Laden...
en: Loading...
es: Cargando...
fr: Chargement...
zh_hans: 加载中...

# newTrip.budget
source: Бюджет
ar: الميزانية
de: Budget
en: Budget
es: Presupuesto
fr: Budget
zh_hans: 预算

# newTrip.budget.comfort
source: Комфорт
ar: مريح
de: Komfort
en: Comfort
es: Confort
fr: Confort
zh_hans: 舒适型

# newTrip.budget.economy
source: Эконом
ar: اقتصادي
de: Sparsam
en: Economy
es: Económico
fr: Économique
zh_hans: 经济型

# newTrip.budget.luxury
source: Люкс
ar: فاخر
de: Luxus
en: Luxury
es: Lujo
fr: Luxe
zh_hans: 豪华型

# newTrip.dates
source: ДАТЫ
ar: التواريخ
de: DATEN
en: DATES
es: FECHAS
fr: DATES
zh_hans: 日期

# newTrip.destination.placeholder
source: Куда поедем?
ar: إلى أين تريد الذهاب؟
de: Wohin geht die Reise?
en: Where to?
es: ¿A dónde vamos?
fr: Où allons-nous ?
zh_hans: 去哪里？

# newTrip.generating
source: Генерирую маршрут...
ar: جاري إنشاء المسار...
de: Route wird erstellt...
en: Generating route...
es: Generando ruta...
fr: Génération de l'itinéraire...
zh_hans: 正在生成路线...

# newTrip.guests
source: ГОСТИ
ar: الضيوف
de: GÄSTE
en: GUESTS
es: VIAJEROS
fr: VOYAGEURS
zh_hans: 游客

# newTrip.interests.title
source: Что вам интересно?
ar: ما الذي يثير اهتمامك؟
de: Was interessiert Sie?
en: What interests you?
es: ¿Qué te interesa?
fr: Qu'est-ce qui vous intéresse ?
zh_hans: 您对什么感兴趣？

# newTrip.title
source: Новая поездка
ar: رحلة جديدة
de: Neue Reise
en: New trip
es: Nuevo viaje
fr: Nouveau voyage
zh_hans: 新行程

# newTrip.wishes
source: Пожелания
ar: التفضيلات
de: Wünsche
en: Preferences
es: Preferencias
fr: Souhaits
zh_hans: 偏好

# newTrip.wishes.description
source: Опишите идеальное путешествие, и я подберу маршрут специально для вас.
ar: صف رحلتك المثالية وسأختار المسار المناسب لك.
de: Beschreiben Sie Ihre ideale Reise und ich stelle eine Route für Sie zusammen.
en: Describe your ideal trip and I'll create a route just for you.
es: Describe tu viaje ideal y crearé una ruta especialmente para ti.
fr: Décrivez votre voyage idéal et je créerai un itinéraire spécialement pour vous.
zh_hans: 描述您理想的旅行，我将为您定制路线。

# newTrip.wishes.placeholder
source: Хочу спокойный отдых...
ar: أريد استراحة هادئة...
de: Ich möchte einen ruhigen Urlaub...
en: I want a relaxing vacation...
es: Quiero unas vacaciones tranquilas...
fr: Je veux des vacances tranquilles...
zh_hans: 我想要一个轻松的假期...

# paywall.loginSubtitle
source: Войдите, чтобы открыть личный кабинет
ar: سجّل الدخول للوصول إلى حسابك
de: Melden Sie sich an, um auf Ihr Konto zuzugreifen
en: Sign in to access your account
es: Inicia sesión para acceder a tu cuenta
fr: Connectez-vous pour accéder à votre compte
zh_hans: 登录以访问您的账户

# settings.language
source: Язык
ar: اللغة
de: Sprache
en: Language
es: Idioma
fr: Langue
zh_hans: 语言

# settings.language.manual
source: Выбрать вручную
ar: اختيار يدوي
de: Manuelle Auswahl
en: Manual selection
es: Selección manual
fr: Sélection manuelle
zh_hans: 手动选择

# settings.language.system
source: Системный язык
ar: لغة النظام
de: Systemsprache
en: System language
es: Idioma del sistema
fr: Langue du système
zh_hans: 系统语言

# tabs.home
source: Главная
ar: الرئيسية
de: Startseite
en: Home
es: Inicio
fr: Accueil
zh_hans: 首页

# tabs.profile
source: Профиль
ar: الملف الشخصي
de: Profil
en: Profile
es: Perfil
fr: Profil
zh_hans: 个人资料

# tabs.saved
source: Сохранено
ar: المحفوظة
de: Gespeichert
en: Saved
es: Guardado
fr: Enregistré
zh_hans: 已保存

# tabs.search
source: Поиск
ar: البحث
de: Suche
en: Search
es: Buscar
fr: Recherche
zh_hans: 搜索

# chat.messageSending
source: Отправка...
en: Sending...
